#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/eggs-projects/infra/runs/run-PDnBSnDEnQUJyTsv

Waiting for the plan to start...

Terraform v1.1.8
on linux_amd64
Initializing plugins and modules...
github_repository.projects["ghost-blog"]: Refreshing state... [id=ghost-blog]
github_repository.projects["test-repo"]: Refreshing state... [id=test-repo]
module.tfe_dev.tfe_workspace.projects["test-repo"]: Refreshing state... [id=ws-SfnrJgVt5Pa4qND4]
module.tfe_dev.tfe_workspace.projects["ghost-blog"]: Refreshing state... [id=ws-PYgtf5qUjmec5gC1]
module.tfe_prod.tfe_workspace.projects["ghost-blog"]: Refreshing state... [id=ws-L1LBC3UZSEpVPgEX]
module.tfe_dev.tfe_variable.aws_account_id["ghost-blog"]: Refreshing state... [id=var-EXXLQJDkhTjrPinc]
module.tfe_dev.tfe_variable.organization["test-repo"]: Refreshing state... [id=var-rL5FG1o3nyvDcw3a]
module.tfe_dev.tfe_variable.project_name["test-repo"]: Refreshing state... [id=var-VjfYSMYJZ1TRUeip]
module.tfe_dev.tfe_variable.aws_account_id["test-repo"]: Refreshing state... [id=var-KkpSpXMqfuymYhhZ]
module.tfe_dev.tfe_variable.project_name["ghost-blog"]: Refreshing state... [id=var-wjmUtCLRhNCGCg9T]
module.tfe_dev.tfe_variable.organization["ghost-blog"]: Refreshing state... [id=var-VtNpGj8Uznax9iT7]
module.tfe_dev.tfe_variable.route53_hosted_zone_name["ghost-blog"]: Refreshing state... [id=var-74wqJmApSP355PtE]
module.tfe_dev.tfe_variable.route53_hosted_zone_name["test-repo"]: Refreshing state... [id=var-QocBoKWYgndBj8UC]
module.tfe_prod.tfe_variable.project_name["ghost-blog"]: Refreshing state... [id=var-oZyN63DNurs5WPLQ]
module.tfe_prod.tfe_variable.organization["ghost-blog"]: Refreshing state... [id=var-xrNqsqt3n2n7PCvi]
module.tfe_prod.tfe_variable.aws_account_id["ghost-blog"]: Refreshing state... [id=var-93W25tcmfs3Ns2Du]
module.tfe_prod.tfe_variable.route53_hosted_zone_name["ghost-blog"]: Refreshing state... [id=var-41JsaZjphGtmPrem]
github_repository_environment.dev["ghost-blog"]: Refreshing state... [id=ghost-blog:dev]
github_actions_secret.tf_api_token["test-repo"]: Refreshing state... [id=test-repo:TF_API_TOKEN]
github_actions_secret.tf_api_token["ghost-blog"]: Refreshing state... [id=ghost-blog:TF_API_TOKEN]
github_repository_environment.prod["ghost-blog"]: Refreshing state... [id=ghost-blog:prod]
module.aws_dev.aws_iam_user.projects["ghost-blog"]: Refreshing state... [id=eggs-projects-ghost-blog-user]
module.aws_dev.aws_iam_user.projects["test-repo"]: Refreshing state... [id=eggs-projects-test-repo-user]
module.aws_dev.aws_iam_policy.route53_record_updates: Refreshing state... [id=arn:aws:iam::470292911211:policy/eggs-projects-deploy-route53-policy]
module.aws_dev.aws_iam_access_key.projects["test-repo"]: Refreshing state... [id=AKIAW275EKRVZ3MHLWVG]
module.aws_dev.aws_iam_access_key.projects["ghost-blog"]: Refreshing state... [id=AKIAW275EKRVY4W47SUK]
module.aws_dev.aws_iam_role.deploy: Refreshing state... [id=eggs-projects-deploy-role]
module.tfe_dev.tfe_variable.access_key["ghost-blog"]: Refreshing state... [id=var-y9b3DuqXBA3u8QeU]
module.tfe_dev.tfe_variable.secret_key["test-repo"]: Refreshing state... [id=var-nfehnNRmmscGF9Ki]
module.tfe_dev.tfe_variable.access_key["test-repo"]: Refreshing state... [id=var-sJ9VXSjcxCKzXZnx]
module.tfe_dev.tfe_variable.secret_key["ghost-blog"]: Refreshing state... [id=var-VwUvW23HYCN64iWj]
module.aws_dev.aws_iam_user_policy.projects["test-repo"]: Refreshing state... [id=eggs-projects-test-repo-user:eggs-projects-test-repo-assume-role-policy]
module.aws_dev.aws_iam_user_policy.eggs_cli[0]: Refreshing state... [id=eggs-cli:eggs-cli-deploy-assume-role-policy]
module.aws_dev.aws_iam_role_policy_attachment.AmazonEC2FullAccess: Refreshing state... [id=eggs-projects-deploy-role-20221123030841241800000001]
module.aws_dev.aws_iam_role_policy_attachment.route53_record_updates: Refreshing state... [id=eggs-projects-deploy-role-20221124021210474500000001]
module.aws_dev.aws_iam_user_policy.projects["ghost-blog"]: Refreshing state... [id=eggs-projects-ghost-blog-user:eggs-projects-ghost-blog-assume-role-policy]
module.aws_prod.aws_iam_policy.route53_record_updates: Refreshing state... [id=arn:aws:iam::174199678932:policy/eggs-projects-deploy-route53-policy]
module.aws_prod.aws_iam_user.projects["ghost-blog"]: Refreshing state... [id=eggs-projects-ghost-blog-user]
module.aws_prod.aws_iam_access_key.projects["ghost-blog"]: Refreshing state... [id=AKIASRDY4E7KPUBNHI73]
module.aws_prod.aws_iam_role.deploy: Refreshing state... [id=eggs-projects-deploy-role]
module.tfe_prod.tfe_variable.access_key["ghost-blog"]: Refreshing state... [id=var-Pr4pju9ToTAB6Pov]
module.tfe_prod.tfe_variable.secret_key["ghost-blog"]: Refreshing state... [id=var-7SdEEzBG6XSrG4ym]
module.aws_prod.aws_iam_role_policy_attachment.route53_record_updates: Refreshing state... [id=eggs-projects-deploy-role-20221126031544382100000001]
module.aws_prod.aws_iam_role_policy_attachment.AmazonEC2FullAccess: Refreshing state... [id=eggs-projects-deploy-role-20221126031544389000000002]
module.aws_prod.aws_iam_user_policy.projects["ghost-blog"]: Refreshing state... [id=eggs-projects-ghost-blog-user:eggs-projects-ghost-blog-assume-role-policy]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.projects["ghost-blog"] has changed
  ~ resource "github_repository" "projects" {
      ~ etag                        = "W/\"d5d4ff98fe38dea77ef3a7927e5842b42afe6a0c0fbcb58ac2163e4c62fe0e1b\"" -> "W/\"fa6f8f7f3265f121e4b7b4c570960e7bacec9c45176f60292ad6a459c137df5e\""
        id                          = "ghost-blog"
        name                        = "ghost-blog"
        # (32 unchanged attributes hidden)

      ~ security_and_analysis {
          - advanced_security {
              - status = "enabled" -> null
            }

          ~ secret_scanning {
              ~ status = "enabled" -> "disabled"
            }

          ~ secret_scanning_push_protection {
              ~ status = "enabled" -> "disabled"
            }
        }

        # (1 unchanged block hidden)
    }

  # module.aws_dev.aws_iam_policy.route53_record_updates has changed
  ~ resource "aws_iam_policy" "route53_record_updates" {
        id          = "arn:aws:iam::470292911211:policy/eggs-projects-deploy-route53-policy"
        name        = "eggs-projects-deploy-route53-policy"
      ~ tags        = {
          + "environment" = "stage"
        }
        # (6 unchanged attributes hidden)
    }

  # module.aws_dev.aws_iam_role.deploy has changed
  ~ resource "aws_iam_role" "deploy" {
        id                    = "eggs-projects-deploy-role"
        name                  = "eggs-projects-deploy-role"
      ~ tags                  = {
          + "environment" = "stage"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.aws_dev.aws_iam_user.projects["ghost-blog"] has changed
  ~ resource "aws_iam_user" "projects" {
        id            = "eggs-projects-ghost-blog-user"
        name          = "eggs-projects-ghost-blog-user"
      ~ tags          = {
          + "environment" = "stage"
        }
        # (5 unchanged attributes hidden)
    }

  # module.aws_dev.aws_iam_user.projects["test-repo"] has changed
  ~ resource "aws_iam_user" "projects" {
        id            = "eggs-projects-test-repo-user"
        name          = "eggs-projects-test-repo-user"
      ~ tags          = {
          + "environment" = "stage"
        }
        # (5 unchanged attributes hidden)
    }

  # module.aws_prod.aws_iam_policy.route53_record_updates has changed
  ~ resource "aws_iam_policy" "route53_record_updates" {
        id          = "arn:aws:iam::174199678932:policy/eggs-projects-deploy-route53-policy"
        name        = "eggs-projects-deploy-route53-policy"
      ~ tags        = {
          + "environment" = "stage"
        }
        # (6 unchanged attributes hidden)
    }

  # module.aws_prod.aws_iam_role.deploy has changed
  ~ resource "aws_iam_role" "deploy" {
        id                    = "eggs-projects-deploy-role"
        name                  = "eggs-projects-deploy-role"
      ~ tags                  = {
          + "environment" = "stage"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.aws_prod.aws_iam_user.projects["ghost-blog"] has changed
  ~ resource "aws_iam_user" "projects" {
        id            = "eggs-projects-ghost-blog-user"
        name          = "eggs-projects-ghost-blog-user"
      ~ tags          = {
          + "environment" = "stage"
        }
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.aws_dev.aws_iam_policy.route53_record_updates will be updated in-place
  ~ resource "aws_iam_policy" "route53_record_updates" {
        id          = "arn:aws:iam::470292911211:policy/eggs-projects-deploy-route53-policy"
        name        = "eggs-projects-deploy-route53-policy"
      ~ tags        = {
          - "environment" = "stage" -> null
        }
      ~ tags_all    = {
          ~ "environment" = "stage" -> "development"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.aws_dev.aws_iam_role.admin_role will be created
  + resource "aws_iam_role" "admin_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::470292911211:user/eggs-projects-admin"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eggs-projects-admin-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "environment" = "development"
          + "repo"        = "https://github.com/michaeldeggers/infra"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "eggs-projects-admin-policy"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = [
                              + "*",
                            ]
                          + Condition = {
                              + StringEquals = {
                                  + "aws:ResourceTag/Owner" = "eggs-projects-*"
                                }
                            }
                          + Effect    = "Allow"
                          + Resource  = "*"
                        },
                      + {
                          + Action   = [
                              + "iam:*",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:iam::470292911211:role/eggs-projects-*",
                              + "arn:aws:iam::470292911211:instance-profile/eggs-projects-*",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # module.aws_dev.aws_iam_role.deploy will be updated in-place
  ~ resource "aws_iam_role" "deploy" {
        id                    = "eggs-projects-deploy-role"
        name                  = "eggs-projects-deploy-role"
      ~ tags                  = {
          - "environment" = "stage" -> null
        }
      ~ tags_all              = {
          ~ "environment" = "stage" -> "development"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.aws_dev.aws_iam_user.admin[0] will be created
  + resource "aws_iam_user" "admin" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "eggs-projects-admin"
      + path          = "/"
      + tags_all      = {
          + "environment" = "development"
          + "repo"        = "https://github.com/michaeldeggers/infra"
        }
      + unique_id     = (known after apply)
    }

  # module.aws_dev.aws_iam_user.projects["ghost-blog"] will be updated in-place
  ~ resource "aws_iam_user" "projects" {
        id            = "eggs-projects-ghost-blog-user"
        name          = "eggs-projects-ghost-blog-user"
      ~ tags          = {
          - "environment" = "stage" -> null
        }
      ~ tags_all      = {
          ~ "environment" = "stage" -> "development"
            # (1 unchanged element hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.aws_dev.aws_iam_user.projects["test-repo"] will be updated in-place
  ~ resource "aws_iam_user" "projects" {
        id            = "eggs-projects-test-repo-user"
        name          = "eggs-projects-test-repo-user"
      ~ tags          = {
          - "environment" = "stage" -> null
        }
      ~ tags_all      = {
          ~ "environment" = "stage" -> "development"
            # (1 unchanged element hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.aws_dev.aws_iam_user_policy.admin_dev[0] will be created
  + resource "aws_iam_user_policy" "admin_dev" {
      + id          = (known after apply)
      + name        = "eggs-projects-admin-assume-role-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + user        = "eggs-projects-admin"
    }

  # module.aws_dev.aws_iam_user_policy.admin_prod will be created
  + resource "aws_iam_user_policy" "admin_prod" {
      + id          = (known after apply)
      + name        = "eggs-projects-admin-assume-role-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:AssumeRole"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::174199678932:role/eggs-projects-admin-role"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + user        = "eggs-projects-admin"
    }

  # module.aws_prod.aws_iam_policy.route53_record_updates will be updated in-place
  ~ resource "aws_iam_policy" "route53_record_updates" {
        id          = "arn:aws:iam::174199678932:policy/eggs-projects-deploy-route53-policy"
        name        = "eggs-projects-deploy-route53-policy"
      ~ tags        = {
          - "environment" = "stage" -> null
        }
      ~ tags_all    = {
          ~ "environment" = "stage" -> "production"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.aws_prod.aws_iam_role.admin_role will be created
  + resource "aws_iam_role" "admin_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::470292911211:user/eggs-projects-admin"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eggs-projects-admin-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "environment" = "production"
          + "repo"        = "https://github.com/michaeldeggers/infra"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "eggs-projects-admin-policy"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action    = [
                              + "*",
                            ]
                          + Condition = {
                              + StringEquals = {
                                  + "aws:ResourceTag/Owner" = "eggs-projects-*"
                                }
                            }
                          + Effect    = "Allow"
                          + Resource  = "*"
                        },
                      + {
                          + Action   = [
                              + "iam:*",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:iam::174199678932:role/eggs-projects-*",
                              + "arn:aws:iam::174199678932:instance-profile/eggs-projects-*",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # module.aws_prod.aws_iam_role.deploy will be updated in-place
  ~ resource "aws_iam_role" "deploy" {
        id                    = "eggs-projects-deploy-role"
        name                  = "eggs-projects-deploy-role"
      ~ tags                  = {
          - "environment" = "stage" -> null
        }
      ~ tags_all              = {
          ~ "environment" = "stage" -> "production"
            # (1 unchanged element hidden)
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.aws_prod.aws_iam_user.projects["ghost-blog"] will be updated in-place
  ~ resource "aws_iam_user" "projects" {
        id            = "eggs-projects-ghost-blog-user"
        name          = "eggs-projects-ghost-blog-user"
      ~ tags          = {
          - "environment" = "stage" -> null
        }
      ~ tags_all      = {
          ~ "environment" = "stage" -> "production"
            # (1 unchanged element hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.aws_prod.aws_iam_user_policy.admin_prod will be created
  + resource "aws_iam_user_policy" "admin_prod" {
      + id          = (known after apply)
      + name        = "eggs-projects-admin-assume-role-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:AssumeRole"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::174199678932:role/eggs-projects-admin-role"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + user        = "eggs-projects-admin"
    }

Plan: 6 to add, 7 to change, 0 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 9 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @michaeldeggers, Action: `pull_request`*